/*********************************************************************************************************************/
/*-----------------------------------------------------Includes------------------------------------------------------*/
/*********************************************************************************************************************/
#include "Buttons.h"

#include "IfxPort.h"
#include "Pin_Map.h"
#include "Platform_Types.h"

/*********************************************************************************************************************/
/*------------------------------------------------------Macros-------------------------------------------------------*/
/*********************************************************************************************************************/
#define NUM_BUTTON   4   // 사용하는 버튼 개수

/*********************************************************************************************************************/
/*---------------------------------------------Function Implementations----------------------------------------------*/
/*********************************************************************************************************************/

void Init_Buttons(void) // 버튼으로 사용되는 디지털 핀을 입력으로 설정. => 사용하는 버튼은 총 4개 (Auto Lock, 열고닫기 버튼, 차량 문 잠금, 비상정지 버튼)
{
//    SET_PIN(IfxPort_P10_2, LOW);

    // set door open/close button as input/inputPullUp
    PIN_MODE(PIN_BTN_AUTO_LOCK, INPUT_MODE);

    // set auto door lock button as input/inputPullUp
    PIN_MODE(PIN_BTN_DOOR_OPCL, INPUT_MODE);

    // set kids lock button as input/inputPullUp
    PIN_MODE(PIN_BTN_KIDS_LOCK, INPUT_MODE);

    // set emergency stop button as input/inputPullUp
    PIN_MODE(PIN_BTN_EMERGENCY_STOP, INPUT_MODE);
}
